{
    "sesion1": [
        "1. Expliqueu molt breument els 7 serveis genèrics necessaris per a totes les aplicacions que necessiten comunicació (+1 \"servei\" de no comunicació).",
        "2. Expliqueu breument el concepte d’arquitectura de capes (torre de comunicacions, protocol stack) que s’usa per implementar aquestes tasques.",
        "3. Expliqueu molt breument els 3 aspectes que especifica i regula un protocol.",
        "4. En un model de capes o arquitectura de protocols, definiu i relacioneu els conceptes de protocol, interfície i servei. Incloeu a la relació qui proporciona serveis una capa N, quins serveis usa, amb qui es comunica per oferir el servei associat, i si hi ha relació directa entre capes no adjacents.",
        "5. En un model de capes o arquitectura de protocols, què s’entén per PDU? En quin lloc de la PDU es troba la informació que inclou una capa per comunicar-se amb la mateixa capa de l’equip remot? I la informació que prové de la capa superior per ser lliurada a la capa superior de l’equip remot?",
        "6. Adjunteu i expliqueu breument el diagrama que mostra el camí que segueix i les transformacions que pateix una PDU intercanviada entre una torre de comunicacions emissora i una receptora.",
        "7. Quins son i amb quina finalitat s’usen (què identifiquen) els 3 tipus d’adreces que calen per tal que una aplicació que es troba en un equip d’una xarxa es pugui comunicar amb una altra aplicació que es troba en un altre equip d’una altra xarxa?",
        "8. Expliqueu breument els avantatges i inconvenients d’usar estàndards.",
        "9. Què significa RFC? Què són les RFC?",
        "10. A continuació hi ha les sigles d’organitzacions internacionals d’estandardització: ANSI, ETSI, IEEE, IETF, ISO, ITU-T, ITU-R, W3C. Digueu a quines organitzacions pertanyen i què signifiquen aquestes sigles, quina és la seva pàgina web i descriviu breument (2-4 línies) a què es dediquen.",
        "11. Llisteu els 2 models de torre (o pila) de comunicació (protocol stack) estàndards i digueu quantes capes tenen.",
        "12. Quin nom reben i quin(s) dels 7 serveis genèrics proporciona/en cadascuna de les 7 capes del model OSI? Hi ha alguna capa que proporcioni més d’un dels 7 serveis genèrics de comunicació.",
        "13. Quin nom reben i quin(s) dels 7 serveis genèrics proporciona/en cadascuna de les capes del model TCP/IP? Quina capa proporciona més d’un dels 7 serveis genèrics?",
        "14. De forma genèrica, quina correspondència hi ha entre les capes del model TCP/IP i les del model OSI? Tenint en compte que hi ha capes equivalents, quins noms de capes s’utilitzen habitualment (independentment del model utilitzat)?",
        "15. Com anomenem les PDU de cadascuna de les capes del model TCP/IP? A quines capes del model TCP/IP s’usen els 3 diferents tipus d’adreces anomenats anteriorment?",
        "16. Llisteu protocols coneguts associats a les diferents capes del model TCP/IP.",
        "17. Quin dels 2 models de comunicació s’usa normalment? Per què creieu que és aquest model el que s’usa i no pas l’altre?",
        "18. Com a resum, digueu quines capes de la pila de protocols TCP/IP i del model OSI se n’ocupen dels següents aspectes de la gestió de comunicacions a través d’una xarxa: a. Dividir en trames el flux de bits a transmetre b. Interconnectar xarxes i determinar la ruta que s’utilitzarà a través de les subxarxes c. Transportar dades extrem a extrem (origen a destinació) d. Intercanviar operacions i dades entre programes específics extrem a extrem (origen a destinació) e. Proporcionar fiabilitat a les dades entre equips de la mateixa xarxa f. Proporcionar fiabilitat a les dades extrem a extrem g. Intercanviar dades entre equips de la mateixa xarxa h. Enviar i rebre bits directament al/del medi de transmissió i. Establiment i control de sessions (“diàlegs”) entre aplicacions finals j. Codificar les dades a transmetre entre aplicacions finals k. Segmentació de les dades d’usuari",
        "19. La meva línia de fibra òptica en teoria em permet rebre dades a 500000000 bps (500 Mbps). Quan descarrego un fitxer al meu ordinador amb l’aplicació FTP (File Transfer Protocol) em surt una finestra amb la velocitat a la qual estic rebent dades i mai (ni a les 6 del matí, quan tothom dorm) no aconsegueixo superar els 450 Mbps (56,25 Mbytes per segon). Sé positivament que el meu proveïdor de serveis d’Internet ISP és honest i realment la línia és de 500 Mbps. Quina explicació, relacionada amb les arquitectures de protocols i la comunicació que s’estableix al seu través, podeu donar a aquesta qüestió?",
        "20. Llisteu els dispositius d’interconnexió de xarxa existents, associant-los a la capa de la torre de comunicacions a la qual treballen (incloeu tant el nom en català/castellà com el nom en anglès).",
        "21. Expliqueu breument el funcionament dels repetidors (repeaters) i dels concentradors (hubs), incloent-hi les similituds i diferències.",
        "22. Expliqueu breument el funcionament dels ponts (bridges) i commutadors (switchs), incloent les similituds i diferències.",
        "23. Expliqueu breument per què són necessaris i la idea del funcionament dels “ponts transparents amb arbre d’expansió” / l’algorisme d’arbre d’expansió.",
        "24. Expliqueu breument la diferència principal entre “ponts traductors” i ponts.",
        "25. Expliqueu breument el funcionament dels encaminadors (routers).",
        "26. Expliqueu breument el funcionament de les passarel·les (gateways).",
        "27. Expliqueu molt breument la diferència principal entre repetidors i concentradors, i la diferència principal entre ponts i commutadors.",
        "28. Expliqueu molt breument la diferència principal entre concentradors i commutadors.",
        "29. Els concentradors (i repetidors), commutadors (i ponts) i encaminadors, prenen algun tipus de decisió per distribuir les dades entre els diferents medis de transmissió que tenen connectats? Per als dispositius que hàgiu contestat que sí, quines PDU i quin camp de la seva capçalera analitzen per prendre les decisions?",
        "30. Quines dades analitza una passarel·la de nivell d’aplicació? Poseu-ne algun exemple.",
        "31. Incloeu i expliqueu les figures-resum on es veu l’estructura de capes dels diferents dispositius d’interconnexió de xarxes, incloent-hi què hi sol haver connectat als seus ports (entrades/sortides)."
    ],
    "sesion2": [
        "1. Llisteu la capa del model TCP/IP implicada directament en l’arquitectura client/servidor i recordeu molt breument la seva funcionalitat (els serveis que ofereix).",
        "2. Expliqueu breument la creació d’aplicacions distribuïdes (= model client/servidor) a partir del model d’aplicació local.",
        "3. Expliqueu breument els conceptes de servidor i client en les aplicacions distribuïdes, i el mode habitual de funcionament d’ambdós.",
        "4. Expliqueu breument els 3 nivells del paradigma client/servidor, quin(s) sol(en) estar en el client i quin(s) en el servidor. Quines altres divisions entre client i servidor són possibles?",
        "5. Expliqueu breument les arquitectures a 3 nivells (Three-tiered), Distribució horitzontal (Horizontal distribution) i distribució d’igual a igual (Peer-to-peer distribution).",
        "6. Expliqueu breument què és el Programari intermedi (Middleware) i inclogueu una imatge de en quin(s) lloc(s) de la torre de comunicacions es podria trobar.",
        "7. Expliqueu molt breument els següents models per implementar aplicacions distribuïdes: · Crides a procediments remots (Remote Procedure Calls, RPC). · Invocació de mètodes remots (Remote Method Invocation, RMI). · Comunicació per paquets/datagrames · Comunicació per fluxos (streams). · Comunicació per missatges (Message Oriented Communitacion, MOM). · Serveis Web (Web Services). · Codi Mòbil. · Agents Mòbils.",
        "8. Llisteu les capes del model TCP/IP implicades directament en els sockets i expliqueu molt breument la funcionalitat (el servei que ofereixen) d’aquestes.",
        "9. Expliqueu breument què es coneix com a socket.",
        "10. Expliqueu molt breument les característiques principals dels protocols de transport TCP i UDP (que ja veurem amb una mica més de detall al tema I.4).",
        "11. Expliqueu què vol dir que les crides a sockets són bloquejants (blocking).",
        "12. Llisteu les primitives bàsiques (crides a sistema / system calls) dels sockets i expliqueu (1- 2 línies) per a què serveixen.",
        "13. Llisteu les funcions de llibreria bàsiques dels sockets i expliqueu (1-2 línies) per a què serveixen.",
        "14. Justifiqueu per què calen a sockets les funcions de llibreria relacionades amb ports i adreces.",
        "15. Llisteu funcions de llibreria dels sockets relacionades amb ports i adreces i expliqueu (1-2 línies) per a què serveixen.",
        "16. Expliqueu breument la diferència entre un servidor iteratiu i un de concurrent.",
        "17. Expliqueu breument la idea de fiabilitat (i no fiabilitat) en el transport de dades, i la relació amb els protocols de transport existents, i amb el concepte de protocol orientat a connexió (connectionful) i no orientat a connexió (connectionless).",
        "18. Expliqueu breument la diferència entre un servidor amb estats (stateful) i un sense estats (stateless).",
        "19. Expliqueu breument el funcionament (algorisme) dels servidors iteratius sense connexió (Connectionless iterative server).",
        "20. Expliqueu breument el funcionament (algorisme) dels servidors iteratius amb connexió (Connectionful iterative server).",
        "21. Expliqueu breument els 2 tipus de clients existents.",
        "22. Per què no tindrien sentit els clients concurrents?",
        "23. Expliqueu breument el funcionament (algorisme) dels clients iteratius sense connexió (Connectionless iterative client).",
        "24. Expliqueu breument el funcionament (algorisme) dels clients iteratius amb connexió (Connectionful iterative client).",
        "25. Expliqueu breument el funcionament (algorisme) dels servidors concurrents amb connexió (Connectionful concurrent server).",
        "26. Expliqueu breument el funcionament (idees bàsiques, no l’algorisme) dels servidors concurrents amb connexió amb un sol procés (Connectionful concurrent server with one process)."
    ],
    "sesion3": [
        "1. Expliqueu breument el modes de comunicació / difusió existents.",
        "2. Expliqueu breument el tipus de connexions existents.",
        "3. Expliqueu breument la problemàtica de les xarxes totalment connectades.",
        "4. Com es soluciona el problema de la Transmissió de dades entre molts equips o a llarga distància, on la comunicació punt a punt entre tots els equips no és viable? Expliqueu breument el funcionament d'aquest mecanisme usat per evitar la problemàtica de les xarxes totalment connectades.",
        "5. Expliqueu les característiques tenen les xarxes commutades: a. De quins 2 elements estan formades les xarxes de comunicació? b. Amb quina topologia (forma) es connecten aquests elements entre ells? c. Per què s’anomenen “commutades” les xarxes de comunicacions? d. Quin és l’objectiu de la commutació / dels commutadors? e. Llisteu els tipus de commutació més utilitzats. (En aquesta pregunta no cal explicarlos)",
        "6. Expliqueu breument les característiques de la topologia en línia (o connexió punt a punt).",
        "7. Expliqueu breument les característiques de la topologia en bus.",
        "8. Expliqueu breument les característiques de la topologia en arbre.",
        "9. Expliqueu breument les característiques de la topologia en anell.",
        "10. Expliqueu breument les característiques de la topologia en estrella. Expliqueu breument les diferents opcions de funcionament (lògiques) de les topologies ‘físiques’ en estrella.",
        "11. Expliqueu breument les característiques de la topologia en malla.",
        "12. Expliqueu breument què és la Frontera [/ vora] de la xarxa (network edge).",
        "13. Expliqueu brument què són les xarxes d’accés (access network).",
        "14. Expliqueu breument què és el nucli de la xarxa (network core).",
        "15. Expliqueu breument què és una xarxa troncal (backbone network).",
        "16. Llisteu i expliqueu breument les característiques físiques principals dels diferents tipus de cables.",
        "17. Llisteu les categories que es defineixen per als cables de parells trenats, i digueu el tipus de cable que normalment s’utilitza i la velocitat de xarxa màxima que suporten les 4 (/5) categories més utilitzades actualment.",
        "18. Expliqueu molt breument el principi físic en el qual es basa el funcionament de la fibra òptica, i les diferències entre els 2 tipus principals de fibra segons la seva construcció.",
        "19. Expliqueu molt breument els 2 tipus de fibra òptica segons la quantitat de nodes de llum que poden portar, relacionant-los amb els tipus en funció de la seva construcció, i incloent el seu abast i utilització.",
        "20. Expliqueu breument en quines topologies s’usen els 3 famílies principals de cables.",
        "21. Expliqueu els 2 tipus de funcionament de les xarxes sense fils.",
        "22. Expliqueu breument 3 tipus de xarxes ad-hoc sense fils.",
        "23. Expliqueu breument les característiques de les xarxes WAN.",
        "24. Expliqueu breument les característiques de les xarxes MAN.",
        "25. Expliqueu breument les característiques de les xarxes LAN.",
        "26. Expliqueu breument les característiques de les xarxes PAN.",
        "27. Expliqueu breument les característiques de les xarxes VPN i els seus 3 usos habituals.",
        "28. Què s’entén per circuit? I per canal?",
        "29. Expliqueu breument la commutació de circuits.",
        "30. Quina relació hi ha entre les tecnologies de xarxes i els cementiris?",
        "31. Expliqueu breument què són la commutació de circuits manual, l’automàtica/ electromecànica, l’electrònica i la digital.",
        "32. Què és la commutació de missatges?",
        "33. Expliqueu breument la filosofia d’emmagatzematge i reenviament (store-and-forward) per a l’enviament d’informació.",
        "34. Quins inconvenients té la commutació de missatges?",
        "35. Què és la commutació de paquets?",
        "36. Quins avantatges i inconvenient té la commutació de paquets?",
        "37. Expliqueu breument la commutació (encaminament) de paquets per datagrames.",
        "38. Expliqueu breument la commutació (encaminament) de paquets per circuits virtuals.",
        "39. Compareu breument els mètodes de commutació (encaminament) de paquets per datagrames i per circuits virtuals.",
        "40. Incloeu i expliqueu la figura que compara els mètodes d’encaminament de circuits i de paquets mode circuit virtual i mode datagrama.",
        "41. Feu una breu comparativa dels valors dels retards entre la Commutació de circuits i la de paquets (distingint mode datagrama o circuit virtual quan calgui).",
        "42. Expliqueu molt breument les característiques del Mode de transferència asíncrona (Asynchronous Transfer Mode, ATM).",
        "43. Què és la multiplexació?",
        "44. Expliqueu breument els 2 tipus de multiplexació presentats a teoria."
    ],
    "sesion4": [
        "1. En quina capa de la torre de comunicacions TCP/IP es troben TCP i UDP? Quins serveis genèrics, dels explicat a la sessió 1, ofereix aquesta capa?",
        "2. Quina és la diferència principal entre TCP i UDP?",
        "3. Per què no és adequat usar IP directament per enviar informació no fiable entre aplicacions? Per a què s’utilitzen els números de port a UDP i a TCP? Quin tipus de dades són els Ports?",
        "4. Quants identificadors de port calen en una capçalera de transport TCP o UDP?",
        "5. En una connexió, cal que el port de l’equip emissor coincideixi amb el de l’equip receptor?",
        "6. Quines són les 3 categories de ports? Com es trien?",
        "7. Expliqueu breument com és el(s) servei(s) que ofereix UDP.",
        "8. Com s’anomenen les PDU d’UDP? Quins camps inclouen?",
        "9. Per què la capçalera UDP no incorpora un número de sèrie? Per què la capçalera UDP si incorpora (opcionalment) un checksum?",
        "10. Per a quin tipus d’aplicacions és adequat l’ús d’UDP?",
        "11. Quines raons argumentaríeu per no fer servir UDP directament per a la transmissió de fitxers?",
        "12. Quin servei ofereix TCP (com a capa de la torre de comunicacions)?. Com s’anomenen les PDU de TCP?",
        "13. Expliqueu molt breument les 5 propietats del servei fiable de transmissió proporcionat per TCP:  Orientació a flux.  Connexió de circuit virtual.  Transferència amb buffer.  Flux no estructurat.  Connexió bidireccional (full duplex).",
        "14. La capçalera de TCP té un camp de longitud de capçalera que no trobem a la de UDP. Tenint en compte l’estructura de la capçalera, per què creieu que hi és en un protocol i no en l’altre?",
        "15. Què és l’MTU? Quina diferència hi ha entre l’MSS i l’MTU? Quina incongruència trobeu entre el nom de les PDU de transport i l’MSS?",
        "16. Expliqueu breument què és i per què cal la segmentació a TCP. Després de l’anunci mutu de l’MSS entre dos equips, a la pràctica, quin MSS (o MTU) usa cadascun dels equips si vol evitar la segmentació a les xarxes extrem?",
        "17. Té sentit considerar el MSS (o equivalent) en UDP? Per què?",
        "18. Llisteu els 2 mecanismes que s’usen a TCP per proporcionar la transferència fiable.",
        "19. Expliqueu breument el mecanisme de Confirmació positiva amb retransmissió (Positive Acknowledgment with Retransmission, PAR)",
        "20. Què és el control de flux i quin mecanisme de transferència fiable també proporciona control de flux a TCP?",
        "21. Expliqueu breument el mecanisme de Finestra lliscant.",
        "22. Què vol dir que TCP utilitza Piggybacking (transmissió encavallada)?",
        "23. Expliqueu breument com s’utilitzen els números de seqüència i ACK a TCP.",
        "24. A quina mida de dades fa referència la mida de la finestra a TCP? Per què cal també una finestra d’emissió? Quantes finestres calen en cada connexió TCP?",
        "25. Implica la pèrdua d’un ACK el re-enviament de dades en TCP? Si la vostra resposta no és un “sempre” o un “mai”, especifiqueu les circumstàncies.",
        "26. Per què hi ha una opció d’anunci del MSS si ja tenim un camp en les capçaleres de tots els segments TCP per a l’anunci de la mida de finestra? (quina diferència hi ha entre MSS i la mida de la finestra?)",
        "27. Per què creieu que els números de port estan al principi de les capçaleres UDP i TCP?",
        "28. Llisteu els flags (bits del camp “codi”) que pot portar qualsevol paquet TCP i expliqueu breument per a què s’usen.",
        "29. En quin tipus de segments TCP sol haver els camps d’opcions?",
        "30. Expliqueu breument el gràfic del mecanisme de three way handshake d’establiment de connexió, incloent-hi l’ús dels flags corresponents i dels camps “Número de seqüència” i “Número de confirmació (ACK)”.",
        "31. Com es trien els números de seqüència inicials a TCP? Per quin motiu? És el mateix número de seqüència als 2 sentits de la comunicació?",
        "32. Expliqueu breument què és una obertura activa i una obertura passiva. Quin tipus d’obertura sol fer un servidor, i quina un client?",
        "33. Quin sentit té establir una connexió a través d’una obertura activa als dos extrems? I té sentit l’obertura passiva als dos extrems?",
        "34. Expliqueu breument què és un tancament actiu i un tancament passiu.",
        "35. Expliqueu breument el mecanisme de tancament de connexió ordenada, incloent l’ús dels flags corresponents.",
        "36. Expliqueu breument què és una desconnexió abrupta i com es realitza.",
        "37. Per a quin tipus d’aplicacions és adequat l’ús de TCP?",
        "38. En quina capa de la torre de comunicacions TCP/IP es troba IP? Quin és el servei genèric, explicat a la sessió 1, que ofereix aquesta capa?",
        "39. Quin tipus de comunicació usa IP: circuit, circuit virtual, datagrama? Per tant, quina relació hi ha entre el camí seguit per un datagrama que va cap a una destinació i el datagrama anterior que va cap la mateixa destinació?",
        "40. A partir dels camps de la capçalera IP: quina és la longitud:  d’una capçalera IP sense opcions  màxima d’una capçalera IP  màxima d’un datagrama IP  màxima de les dades, suposant una capçalera de longituds mínima i màxima  màxima d’un segment TCP",
        "41. Coneix un equip emissor de trames les característiques de totes les xarxes per les quals passarà la trama? Quina relació té la mida màxima dels datagrames amb l’MTU?",
        "42. Per què cal un mecanisme de fragmentació de datagrames? Compareu breument la segmentació TCP amb la fragmentació IP.",
        "43. Expliqueu breument els 3 camps de la capçalera IP utilitzats per a la fragmentació.",
        "44. Què és el TTL i per a què i com s’utilitza?",
        "45. Per a què serveix el camp “Protocol” de la capçalera IP?",
        "46. Quina mida tenen les adreces IP? En el cas general, es modifiquen les adreces IP de destinació i d’origen d’un datagrama en canviar de xarxa?",
        "47. Per a què serveix el protocol ICMP? Sobre quin protocol viatja ICMP? A quin nivell de la torre de comunicacions es considera que es troba ICMP?",
        "48. Què és un “ping” i amb quins missatges ICMP s’implementa?",
        "49. Per a què / quan s’usa el missatge ICMP “Detecció de rutes llargues / circulars”.",
        "50. Llisteu i expliqueu breument per a què serveixen la resta dels principals tipus de missatges que proporciona el protocol ICMP."
    ],
    "sesion5": [
        "1. Quina és la capa de la torre de comunicacions que ens permet connectar xarxes i que necessita de mecanismes d’adreçament global per poder enviar informació fins a qualsevol equip de qualsevol xarxa?",
        "2. Quin tipus de dada són les adreces IP? Llisteu i poseu un exemples de cadascuna de les diferents maneres de representar-les hi que hi ha.",
        "3. Expliqueu breument el format de les adreces IP i els conceptes de NetID i de HostID en aquestes adreces. Per què les adreces IP s’assignen a les interfícies en comptes de als hosts / routers?",
        "4. Una organització gran vol una xarxa amb adreces globals a Internet. Qui assigna les adreces? Què se li assignarà a aquesta organització, i què podrà assignar ella?",
        "5. Quins avantatges i inconvenients té el fet d’usar adreces IP per comptes p.e. d’usar noms?",
        "6. Expliqueu breument l’esquema d’adreçament classful, i quants bits tenen associats de NetId i HostId, i com es poden distingir els tipus de classes A, B, C i D.",
        "7. Expliqueu breument les adreces de difusió i identificació que es defineixen (quan els identificadors de xarxa i de host són tot 0’s i/o tot 1’s).",
        "8. Expliqueu breument quines són i per què s’usen les adreces especials privades o no encaminables, les localhost i les zeroconf.",
        "9. Expliqueu breument per a què es fan servir les màscares, quin és el seu format típic i quin és el seu funcionament.",
        "10. Expliqueu breument l’esquema classless (Classless Inter-Domain Routing, CIDR). Per què ha calgut usar CIDR? Quina relació tenen les adreces CIDR amb les màscares? Què és la notació CIDR (o de barra)?",
        "11. Expliqueu breument per a què s’utilitzen les subxarxes, qui les pot crear i com.",
        "12. Si es té l'adreça d'un equip i els bits (o la màscara) de la (sub)xarxa, com es calcula l'adreça de la (sub)xarxa i com es calcula l'identificador de l'equip dins la (sub)xarxa? Poseu-ne un exemple.",
        "13. Quan tenim n bits de HostID, tant en esquemes classful com classless, es poden usar totes les combinacions possibles de bits per identificar equips dins la xarxa? Quans equips podrem identificar amb n bits?",
        "14. En esquemes d’adreçament classful, quan tenim una subxarxa amb m bits de Net’ID (no NetID), es poden fer servir totes les combinacions possibles de bits per identificar les subxarxes? Quantes subxarxes podrem identificar amb m bits? I en esquemes classless (CIDR)?",
        "15. Expliqueu breument què són les superxarxes i com es creen.",
        "16. Expliqueu breument les diferències entre les adreces IPv6 i les IPv4 pel que fa al número de bits, la seva representació i les seves parts.",
        "17. Quina diferència hi ha entre encaminament (routing) i reencaminament (forwarding)?",
        "18. Expliqueu les diferències pràctiques entre encaminament directe i indirecte. Quines són les adreces físiques i de xarxa, tant d’origen com de destinació, en un encaminament directe? I en un encaminament indirecte?",
        "19. Si tinguéssiu només encaminament indirecte, podríeu tenir interconnexió de xarxes?",
        "20. Quina informació tindrà una taula d’encaminament per poder encaminar? Quin coneixement ha de tenir un equip o un router de la resta de la xarxa per poder encaminar?",
        "21. Per què importa l’ordre en què afegim entrades a la taula d’encaminament? Quin ordre han de seguir? Quines entrades especials pot tenir una taula d’encaminament?",
        "22. Expliqueu breument què passa quan 1 datagrama arriba a un equip (host o router)."
    ],
    "sesion6": [
        "1. Expliqueu molt breument les característiques de DSL, ADSL i VDSL.",
        "2. Expliqueu molt breument les característiques de la Fibra òptica (incloent-hi FTTx i PON).",
        "3. Compareu molt breument (pot ser amb una taula) les tecnologies LAN Wi-Fi IEEE 802.11 i Bluetooth.",
        "4. Per què calen protocols d’Inicialització i Autoconfiguració?",
        "5. Com pot DHCP (Dynamic Host Configuration Protocol) enviar datagrames de xarxa abans de conèixer la seva pròpia adreça?",
        "6. Expliqueu breument les característiques del protocol DHCP. Quin protocol de transport i ports (client i servidor) usa?",
        "7. Tenint en compte la capa sobre la qual viatgen els protocols, justifiqueu que les peticions/respostes de RARP no es poden reencaminar a altres xarxes, mentre que les de DHCP sí. (si us interessa, podeu trobar més informació buscant “BOOTP forwarding”, “DHCP/BOOTP forwarding”, “DHCP/BOOTP relay”, ...).",
        "8. A partir dels camps dels missatges que té DHCP, llisteu i expliqueu breument quina informació ens permet descobrir (demanar).",
        "9. Expliqueu breument el funcionament del protocol DHCP.",
        "10. Quin tipus d’adreça s’utilitza per enviar unes dades (datagrames) fins a un equip en una xarxa remota? Quin tipus d’identificador d’equip és més fàcil de recordar per als humans? Quina estructura s’ha seguit per definir noms per identificar equips a la xarxa?",
        "11. Què és el nom de domini d’un node? Com es forma el nom de domini d’un node? Poseu un o més exemples.",
        "12. Què és un domini primari? Llisteu-ne alguns.",
        "13. Què és el Servei de Noms de Domini (DNS)? Per a què s’utilitza? Quines característiques té?",
        "14. Què és una zona DNS? En quin equip es troba la informació relacionada a un equip?",
        "15. Els equips d’un domini, a qui realitzen inicialment les consultes DNS? Si l’equip consultat no té la informació, quins dos mecanismes hi ha definits per resoldre el problema? Expliqueu-los breument.",
        "16. Quin protocol de transport i quin port utilitza DNS?",
        "17. Expliqueu breument què és un Resource Record (RR, Registre de Recurs), i quants n’hi ha associats a cada equip. En quin(s) equip(s) s’emmagatzemen els RR? Expliqueu breument quins són els 5 components/camps que hi ha emmagatzemats per a cada atribut (Resource Record).",
        "18. Llisteu i descriviu breument alguns dels tipus d’atributs (objectes) que es poden tenir associats a un nom de domini. Quin és l’únic tipus d’atribut que permet adreces IP com a valor? Quin tipus de dades són els valors dels altres tipus d’atribut?",
        "19. Quantes adreces IP pot tenir associades 1 nom de domini? Com podem tenir més d’un nom de domini (p.e. empresa.cat, www.empresa.cat i correu.empresa.cat) associat a la mateixa adreça IP? Quantes entrades de tipus NS cal que hi hagi com a mínim en una zona? Quantes entrades tipus MX pot haver per cada nom de domini?",
        "20. Mireu els Resource Records associats al domini uab.es, que es troben a la transparència “Comandes per utilitzar el servei de DNS”. Expliqueu-ne breument el seu significat.",
        "21. Quins són els 2 tipus d’operació hi ha definit als missatges del protocol DNS?",
        "22. Quins camps cal enviar (dins el camp Question Section) per demanar informació d’un equip? Quins camps s’envien com a resposta (dins els camps Answer Section, Authority Section, Additional Information Section) amb la informació de l’equip? Quina relació hi veieu, tant a les peticions com a les respostes, amb els camps/components dels Resource Records?",
        "23. Expliqueu molt breument i de forma genèrica el mecanisme de Conversió d’adreces de xarxa (Network Address Translation, NAT), que permet usar adreces privades dins una xarxa local i alhora que tots els equips d’aquesta xarxa puguin accedir a Internet.",
        "24. Expliqueu breument els dos mecanismes de NAT.",
        "25. Quan s’usa NAT port-mapped a l’equip emissor, quines adreces i ports d’origen i destinació té un paquet quan surt de l’emissor? I quan es troba a internet?",
        "26. Quins avantatges i desavantatges té el NAT? I el NAT port-mapped?",
        "27. Com ha de ser de taula que ha d’incloure el router que fa el NAT port-mapped?",
        "28. Expliqueu molt breument què vol dir que NAT es pot usar a múltiples nivells. Què és el CG-NAT (Carrier Grade NAT)?",
        "29. Quines possibilitats hi ha per inicialitzar la taula de NAT? Quines s’usen normalment?"
    ]
}